EDT/УТ/src/DataProcessors/ВыгрузкаДанныхВБухгалтерию/ВыгрузкаДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДанныхВБухгалтерию</name>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ВыгрузкаДанныхВБухгалтерию/ВыгрузкаДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгрузкаДанныхВБухгалтерию</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПланВыгрузки</name>
    <type>
      <types>CatalogRef.ПланыВыгрузкиДанныхВБухгалтерию</types>
    </type>
  </resources>
  <resources>
    <name>СуммаТерминал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНаличные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокументаПоступления</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокументаПКО</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокументаОтчетОРозничнойПродаже</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОперацииВведеннойВручную</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПараметрыКонтрагентов/ПараметрыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретСменыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОжиданияПриЗабореТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВычисляемыйЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриёмИтогоСКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъёма</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретУстановкиСуммыПодъемаВодителюБольшеВыставленной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытиеЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВесЗапросаДанныхОПодъемеОтВодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОперативнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперативнойПриемки</name>
    <type>
      <types>EnumRef.ТипыОперативнойПриемки</types>
    </type>
  </resources>
  <resources>
    <name>УчетЗаказовПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетШКПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладскаяОбработкаОтсутствует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АгрегироватьДанныеВОтправляемыхОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СвязкаНастройкиПечатиЧеков</name>
    <type>
      <types>CatalogRef.СвязкиККМ</types>
    </type>
  </resources>
  <resources>
    <name>СпособыКонтроляДнейЗадолженности</name>
    <type>
      <types>EnumRef.СпособыКонтроляДнейЗадолженности</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДоПросрочкиДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАгрегатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОтношенийСКлиентами</name>
    <type>
      <types>EnumRef.ВариантыПечатиОтчетовАгента</types>
    </type>
  </resources>
  <resources>
    <name>setiingId_Strizh</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>login_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>password_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетТоваровПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатьПредоплаченныхЧеков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеМестЗаказаПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКодИдентификацииКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НазначениеКодаИдентификацииКлиентаИССтрижа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСоздаватьМестаЗаказовПоПриходнымАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьКоличествоМестЗаказовПриВыгрузкеАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОдинаковыеШКНаВсехМестахЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьПроверкуБНЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифПримерки</name>
    <type>
      <types>CatalogRef.ТарифыПримерка</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаНаEmail</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаSMS</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонSMSОтправкиСсылкиЛКПолучателяЗаказа</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </resources>
  <resources>
    <name>СопроводительныеДокументыНаходятсяВКоробке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БезусловнаяПечатьБланковЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>accessKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛьготнаяКатегорияЭквайринга</name>
    <type>
      <types>CatalogRef.ЛьготныеКатегорииЭквайринга</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводитьРассылкуКонтроляЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяФормированияАПП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорРассылки</name>
    <type>
      <types>CatalogRef.ОператорыСМСРассылки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ПланыВыгрузкиДанныхВБухгалтерию/ПланыВыгрузкиДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыВыгрузкиДанныхВБухгалтерию</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхБазы1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПоступлениеТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОтчетОРозничныхПродажах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОперациюВведеннуюВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаТоваров</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКассы</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаПКО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаОтчетОРозничныхПродажах</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОперацииВведеннойВручную</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьОбъектыБухгалтерииПриОткрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтатьиДДС</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСтатьиДДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДС</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляНаличныхРасчетовИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьСкладВПроводку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменМеждуСвоимиЮрлицами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыОплат</name>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварПривязанККонтрагенту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТипаОплаты</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТипаОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ВыгрузкаДанныхВБухгалтерию/ManagerModule.bsl
Функция ПолучитьДанныеВыгрузки(ПериодВыгрузки, ДляФормы = Ложь, СхемаКомпоновки = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ПериодВыгрузки) Тогда
		ВызватьИсключение "Не задан период выгрузки данных в бухгалтерию"
	КонецЕсли;	
	
	Если СхемаКомпоновки = Неопределено тогда
		СКД = Обработки.ВыгрузкаДанныхВБухгалтерию.ПолучитьМакет("ДанныеПоОтчетКассира");
	Иначе
		СКД = СхемаКомпоновки;
	Конецесли;
	
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	URLСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСКД));

	НастройкиКомпоновки = СКД.НастройкиПоУмолчанию;
	
	ПараметрПериодВыгрузки = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ПериодВыгрузки");
	ПараметрПериодВыгрузки.Значение = Новый СтандартныйПериод(НачалоДня(ПериодВыгрузки), КонецДня(ПериодВыгрузки));
	ПараметрПериодВыгрузки.Использование = Истина;
	
	Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновки);
	
	ТаблицаДанных = СкомпоноватьВТаблицуЗначений(СКД, Компоновщик);	
	
	Если Не ДляФормы Тогда
		
		ТаблицаДанных.Свернуть("Партнер, Организация, Спецсчет, ПланВыгрузки","СуммаНаличные, СуммаТерминал");

	КонецЕсли;	
	
	Возврат ТаблицаДанных;
КонецФункции

&НаСервере
Функция ПолучитьДанныеВыгрузкиПоОтчету(ПериодВыгрузки, ДляФормы = Ложь) Экспорт

	Если Не ЗначениеЗаполнено(ПериодВыгрузки) Тогда
		ВызватьИсключение "Не задан период выгрузки данных в бухгалтерию"
	КонецЕсли;	

	СКД = Отчеты.ОтчетКассираНовый.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	URLСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСКД));

	НастройкиКомпоновки = СКД.НастройкиПоУмолчанию;
	
	ПараметрПериодВыгрузки = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериодВыгрузки.Значение = Новый СтандартныйПериод(НачалоДня(ПериодВыгрузки), КонецДня(ПериодВыгрузки));
	ПараметрПериодВыгрузки.Использование = Истина;
	
	СписокТерминалов = Новый СписокЗначений;
	СписокТерминалов.Добавить(Справочники.РегиональныеТерминалы.МоскваСтриж);
	СписокТерминалов.Добавить(Справочники.РегиональныеТерминалы.СПбСтриж);
	СписокТерминалов.Добавить(Справочники.РегиональныеТерминалы.ПустаяСсылка());
	
	ПараметрТерминал = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ТерминалДоставки");
	ПараметрТерминал.Значение = СписокТерминалов;
	ПараметрТерминал.Использование = Истина;
	
	ПараметрИнтернетМагазин = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ИнтернетМагазин");
	ПараметрИнтернетМагазин.Использование = Ложь;
	
	Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновки);
	
	ТаблицаДанных = СкомпоноватьВТаблицуЗначений(СКД, Компоновщик);	
	
	ТаблицаДанных.Свернуть("Заказ", "Наличные,БезНаличные");
	
	МассивНеНужныхСтрок = Новый Массив;
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		Если  Не ЗначениеЗаполнено(СтрокаДанных.Заказ) Или (СтрокаДанных.Наличные = 0 И СтрокаДанных.БезНаличные = 0) Тогда
			МассивНеНужныхСтрок.Добавить(СтрокаДанных);
		Конецесли;	
		
	КонецЦикла;	
	
	Для Каждого СтрокаКУдалению Из МассивНеНужныхСтрок Цикл
		ТаблицаДанных.Удалить(СтрокаКУдалению);
	КонецЦикла;		
	
	Запрос = НОвый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДанных.Заказ КАК Заказ,
	               |	ТаблицаДанных.Наличные КАК СуммаНаличные,
	               |	ТаблицаДанных.БезНаличные КАК СуммаТерминал
	               |ПОМЕСТИТЬ ТаблицаЗаказовПред
	               |ИЗ
	               |	&ТаблицаДанных КАК ТаблицаДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаказовПред.Заказ КАК Заказ,
	               |	ТаблицаЗаказовПред.СуммаНаличные КАК СуммаНаличные,
	               |	ТаблицаЗаказовПред.СуммаТерминал КАК СуммаТерминал,
	               |	РеализацияТоваровУслуг.Ссылка КАК ЗаказСсылка,
	               |	РеализацияТоваровУслуг.ТерминалДоставки КАК ТерминалДоставки
	               |ПОМЕСТИТЬ ТаблицаЗаказов
	               |ИЗ
	               |	ТаблицаЗаказовПред КАК ТаблицаЗаказовПред
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ТаблицаЗаказовПред.Заказ = РеализацияТоваровУслуг.Ссылка
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Ссылка В(&МассивРеализаций)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаказов.ЗаказСсылка КАК ЗаказСсылка,
	               |	ТаблицаЗаказов.СуммаНаличные КАК СуммаНаличные,
	               |	ТаблицаЗаказов.СуммаТерминал КАК СуммаТерминал,
	               |	ВЫБОР
	               |		КОГДА НЕ ТаблицаЗаказов.ЗаказСсылка.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ТаблицаЗаказов.ЗаказСсылка.ВладелецТовара.Родитель.ОсновнойМагазин
	               |		ИНАЧЕ ТаблицаЗаказов.ЗаказСсылка.ВладелецТовара
	               |	КОНЕЦ КАК Партнер,
	               |	ВЫБОР
	               |		КОГДА НЕ ТаблицаЗаказов.ЗаказСсылка.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ТаблицаЗаказов.ЗаказСсылка.ВладелецТовара.Родитель.ОсновнойМагазин.ОсновнойДоговорКонтрагента.Организация
	               |		ИНАЧЕ ТаблицаЗаказов.ЗаказСсылка.ВладелецТовара.ОсновнойДоговорКонтрагента.Организация
	               |	КОНЕЦ КАК Организация,
	               |	ТаблицаЗаказов.ТерминалДоставки КАК ТерминалДоставки
	               |ПОМЕСТИТЬ ДанныеПоПартнерам
	               |ИЗ
	               |	ТаблицаЗаказов КАК ТаблицаЗаказов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеПоПартнерам.ЗаказСсылка КАК Заказ,
	               |	ДанныеПоПартнерам.СуммаНаличные КАК СуммаНаличные,
	               |	ДанныеПоПартнерам.СуммаТерминал КАК СуммаТерминал,
	               |	ДанныеПоПартнерам.Партнер КАК Партнер,
	               |	ДанныеПоПартнерам.Организация КАК Организация,
	               |	ВыгрузкаДанныхВБухгалтериюСрезПоследних.Период КАК ДатаВыгрузки,
	               |	ПараметрыКонтрагентовСрезПоследних.Спецсчет КАК Спецсчет,
	               |	ДанныеПоПартнерам.ТерминалДоставки КАК ТерминалДоставки
	               |ПОМЕСТИТЬ ДанныеВыгрузки
	               |ИЗ
	               |	ДанныеПоПартнерам КАК ДанныеПоПартнерам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгрузкаДанныхВБухгалтерию.СрезПоследних(, ДатаВыгрузки = &ДатаВыгрузки) КАК ВыгрузкаДанныхВБухгалтериюСрезПоследних
	               |		ПО ДанныеПоПартнерам.Партнер = ВыгрузкаДанныхВБухгалтериюСрезПоследних.Партнер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	               |		ПО ДанныеПоПартнерам.Партнер = ПараметрыКонтрагентовСрезПоследних.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеВыгрузки.Заказ КАК Заказ,
	               |	ДанныеВыгрузки.СуммаНаличные КАК СуммаНаличные,
	               |	ДанныеВыгрузки.СуммаТерминал КАК СуммаТерминал,
	               |	ДанныеВыгрузки.Партнер КАК Партнер,
	               |	ДанныеВыгрузки.Организация КАК Организация,
	               |	ДанныеВыгрузки.ДатаВыгрузки КАК ДатаВыгрузки,
	               |	ДанныеВыгрузки.Спецсчет КАК Спецсчет,
	               |	ПланыВыгрузкиДанныхВБухгалтерию.Ссылка КАК ПланВыгрузки,
	               |	ДанныеВыгрузки.ТерминалДоставки КАК ТерминалДоставки
	               |ИЗ
	               |	ДанныеВыгрузки КАК ДанныеВыгрузки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПланыВыгрузкиДанныхВБухгалтерию КАК ПланыВыгрузкиДанныхВБухгалтерию
	               |		ПО ДанныеВыгрузки.Организация = ПланыВыгрузкиДанныхВБухгалтерию.Организация
	               |			И ДанныеВыгрузки.Спецсчет = ПланыВыгрузкиДанныхВБухгалтерию.Спецсчет
	               |			И (ПланыВыгрузкиДанныхВБухгалтерию.ПланАктивен)";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", 	ТаблицаДанных);
	Запрос.УстановитьПараметр("МассивРеализаций", ТаблицаДанных.ВыгрузитьКолонку("Заказ"));

	Запрос.УстановитьПараметр("ДатаВыгрузки", 	ПериодВыгрузки);

	ТаблицаВыгрузки = Запрос.Выполнить().Выгрузить();
	
	Если Не ДляФормы Тогда
		
		ТаблицаВыгрузки.Свернуть("Партнер, Организация, Спецсчет, ПланВыгрузки, ТерминалДоставки","СуммаНаличные, СуммаТерминал");

	КонецЕсли;	
	
	Возврат ТаблицаВыгрузки;
	
КонецФункции


Функция СкомпоноватьВТаблицуЗначений(СхемаКомпоновкиДанных, КомпоновщикНастроек) Экспорт

    //Запускаем компоновку
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Создаем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);


	//Выводим в таблицу значений
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = ПроцессорВывода.Вывести(ПроцессорКомпоновки, истина);

	Возврат ТЗ;

КонецФункции
